# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'keychain'

# Development
brew 'imagemagick'
brew 'nginx'
brew 'redis'
brew 'yarn'
brew 'starship'

# TODO nvm

# Apps
cask '1password'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'helo'
cask 'homebrew/cask-drivers/elgato-stream-deck'
cask 'imageoptim'
cask 'insomnia'
cask 'pastebot'
cask 'ray'
cask 'readdle-spark'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'


# TODO 
# Boop
# Notion
# Sublime Text
# git-Tower
# Xcode

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-sauce-code-pro-nerd-font'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
mas 'Spring', id: 1508706541
mas 'Things', id: 904280696
